sdaiIsEqual(Sdai_instS*,Sdai_instS*)
\details
The Is Equal function shall test whether the two specified SDAI identifiers are identical.
\param instance1 [in] The first identifier in the comparison.
\param instance2 [in] The second identifier in the comparison.
\returns In normal condition: sdaiTRUE if instance1 and instance2 are equal;
sdaiFALSE if instance1 and instance2 are not equal.